In [1]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame(
    [["Rohan", "24", "4.00"], ["Mulla", "22", "3.59"]],
    columns=["Name", "Age", "CGPA"],
    index=["1", "2"],
)
df

    Name Age  CGPA
1  Rohan  24  4.00
2  Mulla  22  3.59

In [16]:
print(df.info())
print(df.columns)
print(df.index)

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 1 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   Age     2 non-null      object
 2   CGPA    2 non-null      object
dtypes: object(3)
memory usage: 172.0+ bytes
None
Index(['Name', 'Age', 'CGPA'], dtype='object')
Index(['1', '2'], dtype='object')

In [17]:
df.describe()

         Name Age  CGPA
count       2   2     2
unique      2   2     2
top     Rohan  24  4.00
freq        1   1     1

In [ ]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=["a", "b", "c"])
display(df)

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0